# core handlers
CHECK_IN_NOTHING = (
    "На ваш счет ничего не начислено, так как вы не подписаны "
    "ни на один наш канал 😬\nВы сможете провести следующий "
    "чек-ин ровно через сутки, советуем подписаться!"
)

CHECK_IN_REWARD = (
    "На ваш счет начислен(о) {} поинт(ов) 🥳\n"
    "Вы сможете провести следующий чек-ин ровно через сутки"
)

CHECK_IN_OUT = "Чек-ин недоступен 🚫\nВы сможете провести чек-ин {} UTC."

CHECK_IN_UNSUB = (
    "Вы не подписаны ни на один канал. Подпишитесь, чтобы получить наград!"
)

INFO_TEXT = (
    "Привет 👋🏻\nЗдесь ты можешь заработать всего лишь "
    "подписавшись на каналы и пригласив друзей!\n"
    "Награды получат только лучшие из вас, поэтому "
    "не забывайте каждый день отмечаться и приглашать друзей!"
)

SUPPORT_TEXT = (
    "Если вы столкнулись с какой-то проблемой или обнаружили баг, "
    "вы можете написать создателю бота, который "
    "постарается вам помочь и улучшить бота:\n@dimasamehada"
)
