USER_INFO = (
    "Привет 👋🏻\nТвой UID: {telegram_id}\nНик: {username}\n"
    "Поинты: {points}\nДата присоединения: {join_date}\n"
    "Приглашенные друзья: {referral_count}"
)

REQUIRE_SUBSCRIBE_MESSAGE = "Подпишись на наши каналы, чтобы завершить регистрацию:\n\n{}"

REF_LINK = "Ваша реферальная ссылка:\nhttps://t.me/WhereMoney_refbot?start={}"

IF_OPTIONAL_CHANNELS = (
    "Подписывайтесь на каналы, чтобы получать награды!\n\n"
    "За каждую подписку вы получите по 10 поинтов единоразово.\n"
    "Также, подписки на нас и наших партнеров учитываются при чек-инах: "
    "каждая активная подписка будет приносить на 1 поинт больше за чек-ин.\n"
    "Не теряйте времени и подписываайтесь!\n\n{}"
)


IF_NOT_OPTINAL_CHANNELS = "Актуальных квестов пока что нету :("

NO_REFERRERS = "Пока что нет рефереров."

